app/controllers/articles_controller.rb

SELECT "articles".* FROM "articles"
---
  def index
    @user = current_user
    @articles = Article.all