app/controllers/pages_controller.rb

SELECT COUNT(*) FROM "proms"
SELECT "proms".* FROM "proms"
---
  def proms




    total = Prom.count


    i=0
    arreglo = Array.new

    Prom.all.each do |promo|

SELECT COUNT(*) FROM "articles"
SELECT "articles".* FROM "articles" WHERE "articles"."kind" = ?  [["kind", "1"]]
---
  def productos
    tipo= params[:id]

        total = Article.count
    i=0
    arreglo = Array.new

    Article.where( "kind like ?", "%#{params[:id]}%").each do |prod|

SELECT "offers".* FROM "offers"
---
  def promociones

  	Offer.all.each do |off|