app/controllers/pass_resets_controller.rb

	def create
	  @user = User.find_by(email: params[:pass_reset][:email].downcase)
---
SELECT  "users".* FROM "users" WHERE "users"."email" = ? LIMIT 1  [["email", "admin@jiji.com"]]